tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "tierrun/tap"
brew "python@3.11"
brew "awscli"
brew "glib"
brew "curl"
brew "node"
brew "firebase-cli"
brew "gh"
brew "go"
brew "harfbuzz"
brew "hyperfine"
brew "llvm"
brew "lynx"
brew "nvm"
brew "openjdk"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "starship"
brew "terraform"
brew "tree"
brew "w3m"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "oven-sh/bun/bun"
cask "1password"
cask "docker"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-source-code-pro"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "iterm2-beta"
cask "ngrok"
cask "pgadmin4"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zed"
vscode "alexcvzz.vscode-sqlite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-mermaid"
vscode "circleci.circleci"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "jdinhlife.gruvbox"
vscode "kevinglasson.cornflakes-linter"
vscode "loilo.snazzy-light"
vscode "matangover.mypy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yummygum.city-lights-theme"
vscode "yzhang.markdown-all-in-one"
vscode "zhang-renyang.chat-gpt"
vscode "zxh404.vscode-proto3"
