tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "act"
brew "argocd"
brew "arp-scan"
brew "python@3.13"
brew "awscli"
brew "glib"
brew "cairo"
brew "curl"
brew "docker", link: false
brew "fzf"
brew "gh"
brew "go"
brew "grafana"
brew "graphviz"
brew "helm"
brew "helm-ls"
brew "helmfile"
brew "jenv"
brew "k9s"
brew "kubectl-cnpg"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "libpq"
brew "llvm"
brew "openjdk"
brew "maven"
brew "micro"
brew "minikube"
brew "node"
brew "nmap"
brew "nvm"
brew "openjdk@17"
brew "openjdk@21"
brew "pipx"
brew "pkgconf"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.12"
brew "qemu"
brew "redis"
brew "rust"
brew "terraform"
brew "tree"
brew "wget"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"
brew "mongodb/brew/mongodb-community"
brew "telepresenceio/telepresence/telepresence-oss"
cask "1password"
cask "arc"
cask "docker"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-source-code-pro"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-cloud-sdk"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "zed"
cask "ghostty"
